In [1]:
!pip install pymysql;

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 967.5 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
%%sql sqlite:///stud_db;

In [4]:
%%sql
CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db;
Done.
15 rows affected.

[]

In [5]:
%%sql
CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;



UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db;
Done.
15 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
UPDATE school_details SET stud_email='HG' WHERE stud_ID="stud101";
UPDATE school_details SET stud_email='DM' WHERE stud_ID="stud102";
UPDATE school_details SET stud_email='JW' WHERE stud_ID="stud103";
UPDATE school_details SET stud_email='RW' WHERE stud_ID="stud104";
UPDATE school_details SET stud_email='DU' WHERE stud_ID="stud105";
UPDATE school_details SET stud_email='HT' WHERE stud_ID="stud106";
UPDATE school_details SET stud_email='CC' WHERE stud_ID="stud107";
UPDATE school_details SET stud_email='CY' WHERE stud_ID="stud108";
UPDATE school_details SET stud_email='CM' WHERE stud_ID="stud109";
UPDATE school_details SET stud_email='NM' WHERE stud_ID="stud110";
UPDATE school_details SET stud_email='CN' WHERE stud_ID="stud111";
UPDATE school_details SET stud_email='BK' WHERE stud_ID="stud112";
UPDATE school_details SET stud_email='TO' WHERE stud_ID="stud113";
UPDATE school_details SET stud_email='CD' WHERE stud_ID="stud114";
UPDATE school_details SET stud_email='DA' WHERE stud_ID="stud115";

 * sqlite:///stud_db;
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
CREATE TABLE contact_details (stud_email VARCHAR(50) , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );
INSERT INTO contact_details(stud_email,phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES
('HG',"0712345678","Darius Young","Father","0782382383"),
('DM',"0723456781","Lucy Nderitu","Mother","0723238983"),
('JW',"0734567812","Jerotich Koech","Mother","0779343126"),
('RW',"0745678123","Mwaura Mwangi","Father","0798246347"),
('DU',"0756781234","Ian Patrick","Father","0711234453"),
('HT',"0767812345","Lebron James","Father","0765439233"),
('CC',"0778123456","Magna Carter","Father","0702526243"),
('CY',"0781234567","Cindy Wayne","Mother","0747282839"),
('CM',"0722345678","Farah Maalim","Mother","0753927482"),
('NM',"0733456781","Faiba Mbugua","Father","0713245748"),
('CN',"0744567812","John Doe","Father","0725737383"),
('BK',"0755678123","Klaus Michealson","Father","0789346276"),
('TO',"0766456781","Suluhu Amdany","Mother","0785739259"),
('CD',"0741367812","Daisy Auma","Mother","0791344537"),
('DA',"0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db;
Done.
15 rows affected.

[]

In [8]:
%%sql
CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db;
Done.
15 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql SELECT *
FROM personal_details
LIMIT 1;

 * sqlite:///stud_db;
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male')]

In [ ]:
%%sql SELECT *
FROM contact_details
LIMIT 1;

 * sqlite:///stud_db;
Done.

[('HG', '0712345678', 'Darius Young', 'Father', '0782382383')]

In [ ]:
%%sql SELECT *
FROM financial_details

 * sqlite:///stud_db;
Done.

[('stud101', 'Hermione Granger', 25000, 25000),
 ('stud102', 'Draco Malfo', 25000, 19000),
 ('stud103', 'Jayden Wamashati', 21900, 20000),
 ('stud104', 'Ron Weasley', 22000, 22000),
 ('stud105', 'Dolores Umbridge', 25000, 23400),
 ('stud106', 'Hedwig Tonks', 25000, 27000),
 ('stud107', 'Chao Chang', 24230, 21200),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('stud109', 'Chaptr Mukenya', 25000, 24500),
 ('stud110', 'Natalie Mpema', 25000, 25000),
 ('stud111', 'Crew Nundi', 26000, 26000),
 ('stud112', 'Bandi Kagunda', 25000, 20900),
 ('stud113', 'Testimony Omolo', 25000, 22300),
 ('stud114', 'Career Mpya', 19000, 19000),
 ('stud115', 'Deamon Anduro', 20800, 20800),
 (None, 'Bella Ciao', None, None)]

In [ ]:
%%sql SELECT *
FROM school_details
limit 1;

 * sqlite:///stud_db;
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HG')]

Using JOIN get the student names, school id, email, phone number (new_stud_details)

In [65]:
%%sql SELECT stud_name, pd.stud_ID, phone_number, stud_email
FROM personal_details as pd
JOIN school_details as sd ON pd.stud_ID = sd.stud_ID

 * sqlite:///stud_db;
Done.

[('Hermione Granger', 'stud101', '0712345678', 'HG'),
 ('Draco Malfo', 'stud102', '0723456781', 'DM'),
 ('Jayden Wamashati', 'stud103', '0734567812', 'JW'),
 ('Ron Weasley', 'stud104', '0745678123', 'RW'),
 ('Dolores Umbridge', 'stud105', '0756781234', 'DU'),
 ('Hedwig Tonks', 'stud106', '0767812345', 'HT'),
 ('Chao Chang', 'stud107', '0778123456', 'CC'),
 ('Curfew Yaeitpm', 'stud108', '0781234567', 'CY'),
 ('Chaptr Mukenya', 'stud109', '0722345678', 'CM'),
 ('Natalie Mpema', 'stud110', '0733456781', 'NM'),
 ('Crew Nundi', 'stud111', '0744567812', 'CN'),
 ('Bandi Kagunda', 'stud112', '0755678123', 'BK'),
 ('Testimony Omolo', 'stud113', '0766456781', 'TO'),
 ('Career Mpya', 'stud114', '0741367812', 'CD'),
 ('Deamon Anduro', 'stud115', '0744421123', 'DA')]

Create a table with all the details from contacts to school and financial details (full_stud_details)

In [ ]:
%%sql CREATE TABLE full_stud_details AS
select
from contact_details as cd
left join school_details as sd on cd.stud_email = sd.stud_email
left join financial_details as fd ON sd.stud_ID = fd.stud_ID

 * sqlite:///stud_db;
Done.

[]

In [ ]:
%%sql select * from full_stud_details
limit 2

 * sqlite:///stud_db;
Done.

[('HG', '0712345678', 'Darius Young', 'Father', '0782382383', 'stud101', 'Nakuru', 'Nairobi', 'In school', 'HG', 'stud101', 'Hermione Granger', 25000, 25000),
 ('DM', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983', 'stud102', 'Nairobi', 'Nakuru', 'In school', 'DM', 'stud102', 'Draco Malfo', 25000, 19000)]

Add student names on any empty row of stud_name in financial_details

In [ ]:
%%sql INSERT INTO financial_details (stud_name) values
("Bella Ciao")

 * sqlite:///stud_db;
1 rows affected.

[]

Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [ ]:
%%sql
SELECT sum(fee_paid) AS total_fee_balance, sum(sem_fee - fee_paid) AS deficit
from financial_details

 * sqlite:///stud_db;
Done.

[(339600, 19330)]

Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [ ]:
%%sql SELECT count(stud_ID) as No_of_stu, current_home_county
from school_details
GROUP BY current_home_county
order by 1 asc;

 * sqlite:///stud_db;
Done.

[(1, 'Nyamira'),
 (2, 'Kiambu'),
 (2, 'Kisumu'),
 (2, 'Nairobi'),
 (2, 'Samburu'),
 (3, 'Kericho'),
 (3, 'Nakuru')]

Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [ ]:
%%sql select sum(gender="Male") as Male_no , sum(gender="Female") as Female_no,
sd.secondary_school_county
from personal_details as pd
join school_details as sd on pd.stud_ID = sd.stud_ID
group by secondary_school_county

 * sqlite:///stud_db;
Done.

[(1, 3, 'Mombasa'),
 (4, 2, 'Nairobi'),
 (1, 2, 'Nakuru'),
 (1, 0, 'Taita Taveta'),
 (1, 0, 'Turkana')]

 Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [ ]:
%%sql select count(next_of_kin_relation),
next_of_kin_relation
from contact_details
group by next_of_kin_relation

 * sqlite:///stud_db;
Done.

[(8, 'Father'), (7, 'Mother')]

 On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)

In [16]:
%%sql ALTER TABLE financial_details
ADD fee_cleared boolean

 * sqlite:///stud_db;
Done.

[]

In [22]:
%%sql UPDATE financial_details
SET fee_cleared = CASE When sem_fee <= fee_paid Then 'True'
when sem_fee > fee_paid Then 'False'
End;

 * sqlite:///stud_db;
15 rows affected.

[]

In [24]:
%%sql SELECT *
FROM financial_details
LIMIT 3;

 * sqlite:///stud_db;
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 'True'),
 ('stud102', 'Draco Malfo', 25000, 19000, 'False'),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 'False')]

Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [55]:
%%sql WITH fee AS (SELECT stud_name, stud_ID
FROM financial_details as fd
where fee_cleared = 'True')

SELECT f.stud_name, pd.national_ID
from fee as f
JOIN personal_details as pd ON f.stud_ID = pd.stud_ID

 * sqlite:///stud_db;
Done.

[('Hermione Granger', 344534),
 ('Ron Weasley', 377302),
 ('Hedwig Tonks', 307243),
 ('Natalie Mpema', 339152),
 ('Crew Nundi', 339746),
 ('Career Mpya', 321746),
 ('Deamon Anduro', 390234)]